Documents/ДвижениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>&#x0414;&#x0432;&#x0438;&#x0436;&#x0435;&#x043D;&#x0438;&#x0435;&#x0422;&#x043E;&#x0432;&#x0430;&#x0440;&#x043E;&#x0432;</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.&#x041D;&#x043E;&#x043C;&#x0435;&#x043D;&#x043A;&#x043B;&#x0430;&#x0442;&#x0443;&#x0440;&#x0430;</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.&#x0425;&#x0430;&#x0440;&#x0430;&#x043A;&#x0442;&#x0435;&#x0440;&#x0438;&#x0441;&#x0442;&#x0438;&#x043A;&#x0438;</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ДвижениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяСтрока.Характеристика = ПолучитьХарактеристикуПоУмолчаниюНаСервере(ТекущаяСтрока.Номенклатура);
КонецПроцедуры

&НаСервере
Функция ПолучитьХарактеристикуПоУмолчаниюНаСервере(Номенклатура)
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат ПолучитьПустуюХарактеристикуНаСервере();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Характеристики.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Характеристики КАК Характеристики
	|ГДЕ
	|	Характеристики.Владелец = &Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	Характеристики.Код";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПолучитьПустуюХарактеристикуНаСервере();
КонецФункции

&НаСервере
Функция ПолучитьПустуюХарактеристикуНаСервере()
	Возврат Справочники.Характеристики.ПустаяСсылка();
КонецФункции
